Courses/7140/Lectures/Assertions/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-13 Sun 19:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On Assertions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="On Assertions in Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">On Assertions</h1>
<p>
Landing page for Assertions.
</p>

<div id="outline-container-org41f4e6d" class="outline-2">
<h2 id="org41f4e6d"><span class="section-number-2">1</span> Assertions Intro</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="./assertions-101.html">./assertions-101.html</a> A fairly long overview. Process state,
invariants, Floyd-Hoare Triplets, Pre- Post-Conditions.</li>
<li><a href="./assertions-in-the-small.html">./assertions-in-the-small.html</a> Short programs with assertions</li>
<li><a href="../Examples/tiny-examples.html">../Examples/tiny-examples.html</a> Tiny Programming Examples with a Software Engineering Perspective</li>
<li>The <a href="./3np1.html">3n+1</a> Termination Problem</li>
<li><a href="./Java/assertions-java.html">Assertions in Java</a></li>
<li><a href="./CPP/assertions-cpp.html">Assertions in C++</a></li>
<li><a href="./practical-advice.html">Practical-Advice</a> on Writing Assertions</li>
</ol>
</div>
</div>

<div id="outline-container-org9a99f12" class="outline-2">
<h2 id="org9a99f12"><span class="section-number-2">2</span> WP Calculus</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="./WP/wp.html">Weakest Preconditions</a>, wp(S, Q).  Dijkstra.</li>
</ol>
</div>
</div>

<div id="outline-container-org8e99923" class="outline-2">
<h2 id="org8e99923"><span class="section-number-2">3</span> Java Modeling Language (JML)</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="http://www.openjml.org/">http://www.openjml.org/</a></li>
<li><a href="./JML/jml.html">JML</a> Intro</li>
</ol>
</div>
</div>

<div id="outline-container-org183a400" class="outline-2">
<h2 id="org183a400"><span class="section-number-2">4</span> Tools for Assertions</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="http://frama-c.com/">http://frama-c.com/</a> "Frama-C is an extensible and collaborative
platform dedicated to source-code analysis of C software." FOSS.</li>

<li><a href="http://www.key-project.org/">http://www.key-project.org/</a> "Integrated Deductive Software Design"
For Java.  FOSS.</li>

<li><a href="http://types.cs.washington.edu/checker-framework/">http://types.cs.washington.edu/checker-framework/</a> "The Checker
Framework enhances Java's type system &#x2026;  detect and prevent
errors &#x2026;  includes compiler plug-ins ("checkers") that find bugs
or verify their absence."  FOSS. 2016</li>

<li><a href="http://www.coverity.com/">http://www.coverity.com/</a> Research from Stanford U.  Discovered
1000+ bugs in Linux kernel.  Bought by <a href="https://www.synopsys.com/">https://www.synopsys.com/</a>.
Expensive to buy their service commercially.  "Coverity Scan is our
free, cloud-based solution specifically for the Open Source
Community."  Read <a href="https://www.synopsys.com/software-integrity.html">https://www.synopsys.com/software-integrity.html</a></li>

<li>2018 All the above are actively being used and developed.</li>
</ol>
</div>
</div>

<div id="outline-container-org4e5e033" class="outline-2">
<h2 id="org4e5e033"><span class="section-number-2">5</span> Design by Contract</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="../OODesign/design-by-contract.html">../OODesign/design-by-contract.html</a></li>

<li><a href="../OODesign/meyer-design-by-contract-1992-markedUp.pdf">../OODesign/meyer-design-by-contract-1992-markedUp.pdf</a> Bertrand
Meyer's full paper with marked up areas by me.</li>

<li><a href="https://event.on24.com/eventRegistration/EventLobbyServlet?target=reg20.jsp&amp;referrer=&amp;eventid=1043668&amp;sessionid=1&amp;key=9B3EA9E12B1EAAAAEDA255B47EC6998A&amp;regTag=&amp;sourcepage=register">Design-by-Contract</a> Webinar by Bertrand Meyer, Professor of Software
Engineering, ETH Zurich; ACM Fellow; September 17, 2015</li>

<li><a href="./JML/jmldbc-2006-markedUp.pdf">./JML/jmldbc-2006-markedUp.pdf</a>  Design-by-Contract <a href="./JML/jmldbc.pdf">./JML/jmldbc.pdf</a></li>

<li><a href="http://google-opensource.blogspot.com/2011/02/contracts-for-java.html">http://google-opensource.blogspot.com/2011/02/contracts-for-java.html</a>
February 4, 2011</li>
</ol>
</div>
</div>

<div id="outline-container-orged5205e" class="outline-2">
<h2 id="orged5205e"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<p>
Embedded.  All Recommended Reading.
</p>
</div>
</div>

<div id="outline-container-orgb9ee5c1" class="outline-2">
<h2 id="orgb9ee5c1"><span class="section-number-2">7</span> End</h2>
<div class="outline-text-2" id="text-7">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2015-09-03
</div>
</body>
</html>
